# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>  功能测试1:未完成
# 功能测试1:用户从主页进入
##### >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>  功能测试1.1:未完成
##### 功能测试1.1：从主页搜索框开始到完成下单支付的整个流程。
#####
##### 用户进入主页，看到搜索框，点击搜索框进入搜索页面
##### 用户看到页面中的热门搜索一栏有几项热门搜索的内容
##### customer.views.topSearch
#####
##### 用户看到智能推荐栏有几项推荐的菜品
##### customer.views.recommendDish
#####
######### >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>  分支1.11:未完成
######### 分支1.11:输入关键字,搜索关键字
######### 用户在搜索框输入"番茄",点击搜索
######### 用户发现热门搜索框和智能推荐框消失了
######### 用户看到在当前页面出现了搜索结果框
######### 用户看到搜索结果框内有按"番茄"搜索出来的若干项结果,其中包含了相关的食材和菜品
######### food.views.search
######### {'dishes': [
################# {'name': '番茄炒蛋', 'estPrice': 6.5, 'discount': 1.5, 'like': 5},
################# {'name': '番茄土豆片', 'estPrice': 9, 'discount': 2.5, 'like': 3},
################# {'name': '红烧牛肉', 'estPrice': 19, 'discount': 2.5, 'like': 3},
################# {'name': '酸辣土豆丝', 'estPrice': 8, 'discount': 1.5, 'like': 4},
################# {'name': '糖醋排骨', 'estPrice': 17, 'discount': 2.5, 'like': 5}
################# ],
######### 'materials': [
################# {'name': '番茄', 'breed': '大红番茄'},
################# {'name': '番茄', 'breed': '粉红番茄'}
################# ]
########## }
#########
############# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>  分支1.111:未完成
############# 分支1.111:点击搜索到的菜品
############# 用户看到搜索结果中有"番茄炒蛋",用户点击了"番茄炒蛋",用户看到打开了新的"番茄炒蛋"的页面
#############
############# 页面的标题为"番茄炒蛋",有两张番茄炒蛋的图片,有估计的价格,有结算优惠价,有自己对"番茄炒饭"的评级,
############# 页面上有食材名为"番茄",品种为"大红番茄",食材用量为2个,重量约为0.7千克,属于小个的番茄,番茄的供应商为"连贵-蔬菜档"
############# 页面上有食材名为"鸡蛋",品种为"农家蛋",食材用量为4个,重量约为1.2千克,鸡蛋的供应商为"品泰贸易有限公司"
############# food.views.getDishDetail
############# 页面上有一个增加食材按钮

############# <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<  分支测试1.111尾部
######### <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<  分支测试1.11尾部
##### <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<  功能测试1.1尾部
# <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<  功能测试1尾部